cask_args appdir: "/Applications"

tap "aws/tap"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
brew "act"
brew "argocd"
brew "asdf"
brew "bat"
brew "ffmpeg"
brew "gawk"
brew "gh"
brew "ghq"
brew "git"
brew "git-secrets"
brew "gpg"
brew "go"
brew "helm"
brew "jq"
brew "kind"
brew "kubernetes-cli"
brew "mas"
brew "mosquitto"
brew "nginx"
brew "peco"
brew "podman"
brew "shellcheck"
brew "skhd"
brew "starship"
brew "tektoncd-cli"
brew "telnet"
brew "tree"
brew "watch"
brew "yabai"
brew "zsh-completions"
brew "aws/tap/aws-sam-cli"

cask "1password"
cask "1password-cli"
cask "alfred"
cask "font-hack-nerd-font"
cask "clipy"
cask "discord"
cask "docker"
cask "google-chrome"
cask "google-japanese-ime"
cask "iterm2"
cask "visual-studio-code"
cask "zoom"

if OS.mac?
  mas "Kindle", id: 405399194
  mas "LINE", id: 539883307
  mas "RunCat", id: 1429033973
  mas "Slack", id: 803453959
end
