cask_args appdir: "/Applications"

tap "aws/tap"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "sanemat/font"
brew "act"
brew "argocd"
brew "readline", link: true
brew "asdf"
brew "bat"
brew "curl"
brew "ffmpeg"
brew "fontforge"
brew "gh"
brew "ghq"
brew "git"
brew "git-secrets"
brew "helm"
brew "jq"
brew "kind"
brew "kubeseal"
brew "mas"
brew "mosquitto"
brew "nginx"
brew "peco"
brew "podman"
brew "shellcheck"
brew "starship"
brew "tektoncd-cli"
brew "telnet"
brew "tree"
brew "watch"
brew "yq"
brew "zsh-completions"
brew "aws/tap/aws-sam-cli"

if OS.mac?
    cask "1password"
    cask "1password-cli"
    cask "iterm2"
    cask "clipy"
    cask "discord"
    cask "docker"
    cask "font-hack-nerd-font"
    cask "google-chrome"
    cask "google-cloud-sdk"
    cask "google-japanese-ime"
    cask "microsoft-teams"
    cask "rancher"
    cask "raycast"
    cask "rectangle"
    cask "virtualbox"
    cask "visual-studio-code"
    cask "zoom"

    mas "Kindle", id: 405399194
    mas "LINE", id: 539883307
    mas "Numbers", id: 409203825
    mas "Pages", id: 409201541
    mas "RunCat", id: 1429033973
    mas "Slack", id: 803453959
    mas "Xcode", id: 497799835
end
