tap "aws/tap"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "nektos/tap"
tap "sanemat/font"
brew "act"
brew "anyenv"
brew "openssl@1.1"
brew "readline", link: true
brew "python@3.9"
brew "awscli"
brew "bat"
brew "glib"
brew "pkg-config"
brew "cairo"
brew "ceres-solver"
brew "libssh2"
brew "curl"
brew "libevent"
brew "unbound"
brew "gnutls"
brew "gobject-introspection"
brew "harfbuzz"
brew "libass"
brew "srt"
brew "ffmpeg"
brew "pango"
brew "fontforge"
brew "freetds"
brew "gh"
brew "ghq"
brew "git"
brew "git-secrets"
brew "go"
brew "jq"
brew "krb5"
brew "kubernetes-cli"
brew "libpq"
brew "libxml2"
brew "libxmlsec1"
brew "mas"
brew "mercurial"
brew "mysql"
brew "nghttp2"
brew "nginx"
brew "numpy"
brew "oath-toolkit"
brew "vtk"
brew "opencv"
brew "openssl@3"
brew "peco"
brew "python@3.8"
brew "sphinx-doc"
brew "starship"
brew "telnet"
brew "tree"
brew "watch"
brew "zsh-completions"
brew "aws/tap/aws-sam-cli"
brew "sanemat/font/ricty"
cask "alfred"
cask "docker"
cask "google-chrome"
cask "google-japanese-ime"
cask "ngrok"
mas "AdGuard for Safari", id: 1440147259
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "LINE", id: 539883307
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "RunCat", id: 1429033973
mas "Slack", id: 803453959
mas "Xcode", id: 497799835
