amazonwebservices.aws-toolkit-vscode
bradlc.vscode-tailwindcss
christian-kohler.path-intellisense
DavidAnson.vscode-markdownlint
dbaeumer.vscode-eslint
esbenp.prettier-vscode
GitHub.vscode-pull-request-github
golang.go
hediet.vscode-drawio
jrebocho.vscode-random
mikestead.dotenv
ms-azuretools.vscode-docker
MS-CEINTL.vscode-language-pack-ja
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
naumovs.color-highlight
negokaz.zenn-editor
octref.vetur
oderwat.indent-rainbow
Orta.vscode-jest
PKief.material-icon-theme
pnp.polacode
rangav.vscode-thunder-client
redhat.vscode-yaml
shardulm94.trailing-spaces
silvenon.mdx
soerenuhrbach.vscode-deepl
timonwong.shellcheck
vsls-contrib.codetour
WakaTime.vscode-wakatime
wayou.vscode-todo-highlight
yzhang.markdown-all-in-one
