1Password.op-vscode
amazonwebservices.aws-toolkit-vscode
astro-build.astro-vscode
bierner.markdown-emoji
bierner.markdown-footnotes
bradlc.vscode-tailwindcss
christian-kohler.path-intellisense
DavidAnson.vscode-markdownlint
dbaeumer.vscode-eslint
eamodio.gitlens
esbenp.prettier-vscode
exiasr.hadolint
formulahendry.auto-rename-tag
GitHub.vscode-pull-request-github
golang.go
hashicorp.terraform
hediet.vscode-drawio
janisdd.vscode-edit-csv
jrebocho.vscode-random
k--kato.docomment
kleber-swf.unity-code-snippets
mechatroner.rainbow-csv
mikestead.dotenv
ms-azuretools.vscode-docker
MS-CEINTL.vscode-language-pack-ja
ms-dotnettools.csharp
ms-python.isort
ms-python.python
ms-toolsai.vscode-jupyter-cell-tags
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.remote-explorer
ms-vsliveshare.vsliveshare
ms-vsliveshare.vsliveshare-pack
naumovs.color-highlight
negokaz.zenn-editor
octref.vetur
oderwat.indent-rainbow
Orta.vscode-jest
pflannery.vscode-versionlens
PKief.material-icon-theme
pnp.polacode
Prisma.prisma
rangav.vscode-thunder-client
redhat.vscode-yaml
shardulm94.trailing-spaces
silvenon.mdx
soerenuhrbach.vscode-deepl
streetsidesoftware.code-spell-checker
taichi.vscode-textlint
timonwong.shellcheck
vsls-contrib.codetour
WakaTime.vscode-wakatime
wayou.vscode-todo-highlight
yzhang.markdown-all-in-one
